/*
product(id, name, type_id, expired_date, price)

product_type(id, name)
*/

CREATE TABLE product_type(
id SERIAL PRIMARY KEY,
name VARCHAR(50) NOT NULL
);

CREATE TABLE product(
id SERIAL PRIMARY KEY,
name VARCHAR(50) NOT NULL,
type_id INT NOT NULL,
expired_date DATE NOT NULL,
price INT NOT NULL DEFAULT 0,
FOREIGN KEY (type_id) REFERENCES product_type(id)
);

INSERT INTO product_type (name) VALUES
('молоко'), ('сыр'), ('мясо'), ('рыба'), ('птица'), ('бакалея');

INSERT INTO product (name, type_id, expired_date, price) VALUES
('акулий стейк', 4, '2019-08-13', 1000),
('камбала', 4, '2019-07-09', 500),
('батон нарезной', 6, '2019-06-13', 30),
('пирог невский', 6, '2019-06-30', 345),
('батон нарезной', 6, '2019-06-13', 30),
('батон нарезной', 6, '2019-06-13', 30),
('батон пшеничный', 6, '2019-06-13', 30),
('батон пшеничный', 6, '2019-06-13', 30),
('батон пшеничный', 6, '2019-06-13', 30),
('батон пшеничный', 6, '2019-06-13', 30),
('дарнинский', 6, '2019-06-13', 30),
('дарнинский', 6, '2019-06-13', 30),
('дарнинский', 6, '2019-06-13', 30),
('дарнинский', 6, '2019-06-13', 30),
('дарнинский', 6, '2019-06-13', 30),
('молоко 3,2', 1, '2019-07-20', 79),
('молоко 2,2', 1, '2019-07-15', 69),
('молоко 1,2', 1, '2019-07-19', 59),
('вкусное мороженое молочное', 1, '2019-07-19', 700),
('мороженое молочное вкуснейшее', 1, '2019-07-19', 800),
('сыр адыгейский', 2, '2019-07-15', 300),
('сыр адыгейский', 2, '2019-07-15', 300),
('сыр адыгейский', 2, '2019-07-15', 300),
('сыр адыгейский', 2, '2019-07-15', 300),
('сыр советский', 2, '2019-06-14', 400),
('сыр советский', 2, '2019-06-14', 400),
('сыр советский', 2, '2019-06-14', 400),
('сыр советский', 2, '2019-06-14', 400),
('пармезан', 2, '2019-07-13', 500),
('пармезан', 2, '2019-07-13', 500),
('пармезан', 2, '2019-07-13', 500),
('пармезан', 2, '2019-07-13', 500),
('мясо мороженое', 3, '2019-08-19', 400),
('свинина', 3, '2019-09-30', 350),
('мясо куропатки мороженое', 5, '2019-09-30', 453);

